In [1]:
##### 8.2 데이터 합치기 #####

In [1]:
##### 8.2.1 데이터베이스 스타일로 DataFrame 합치기 #####

In [2]:
# merge나 join 연산은 관계형 데이터베이스의 핵심적인 연산인데, 하나 이상의 키를 사용해서 데이터 집합의 로우를 합친다.

import numpy as np
import pandas as pd

In [6]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                   'data1': range(7)})

In [7]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                   'data2': range(3)})

In [9]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [10]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [12]:
# 어떤 컬럼을 병합할 것인지 명시하지 않아 merge함수는 중복된 컬럼 이름을 키로 사용했다. (key 컬럼)

pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [13]:
# 두 객체에 중복된 컬럼 이름이 하나도 없으면 따로 지정해주면 된다.

df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                   'data1': range(7)})

In [14]:
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                   'data2': range(3)})

In [15]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [20]:
# merge 함수는 기본적으로 내부 조인을 수행하여 교집합인 결과를 반환한다.
# how 인자로 left, right, outer를 넘겨 왼쪽 조인, 오른쪽 조인, 외부 조인을 수행할 수도 있다.
# 외부 조인은 합집합인 결과를 반환하고, 왼쪽조인과 오른쪽 조인은 각각 왼쪽 혹은 오른쪽의 모든 로우를 포함하는 결과를 반환한다.

In [21]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [22]:
# 다대다 병합은 잘 정의되어 있긴 하나 직관적이진 않다.
# 다대다 조인은 두 로우의 데카르트 곱을 반환한다.
# df1에는 3개의 b로우가 있고 오른쪽에는 2개의 b로우가 있기 때문에 결과는 6개의 b로우가 생성된다.

df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

In [23]:
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
                   'data2': range(5)})

In [24]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [25]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [26]:
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [27]:
# 여러 개의 키를 병합하려면 컬럼 이름이 담긴 리스트를 넘기면 된다.

left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                    'key2': ['one', 'two', 'one'],
                    'lval': [1, 2, 3]})

In [28]:
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                     'key2': ['one', 'one', 'one', 'two'],
                     'rval': [4, 5, 6, 7]})

In [29]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [30]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [31]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [32]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [33]:
# 겹치는 컬럼 이름 처리
# 축 이름을 변경하고 수동으로 컬럼이름을 겹치게 하거나, 
# merge 함수에 있는 suffixes 인자로 두 DataFrame 객체에서 겹치는 컬럼 이름 뒤에 붙일 문자열을 지정할 수도 있다.

pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [34]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [35]:
##### 8.2.2 색인 병합하기 #####

In [36]:
left1= pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                    'value': range(6)})

In [37]:
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [38]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [39]:
right1

   group_val
a        3.5
b        7.0

In [40]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [41]:
# 병합은 기본적으로 교집합을 구하지만 외부 조인을 실행해 합집합을 구할 수도 있다.

pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [42]:
# 계층 색인된 데이터는 암묵적으로 여러 키를 병합하는 것이라 약간 복잡하다.

lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
                     'key2': [2000, 2001, 2002, 2001, 2002],
                     'data': np.arange(5.)})

In [43]:
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
                     index=[['Nevada', 'Nevada', 'Ohio', 'Ohio', 'Ohio', 'Ohio'],
                           [2001, 2000, 2000, 2000, 2001, 2002]],
                     columns=['event1', 'event2'])

In [44]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [45]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [46]:
# 이 경우 리스트로 여러 개의 컬럼을 지정해 병합해야 한다. (중복되는 색인값을 다룰 때는 how='outer'옵션을 이용한다.)

pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [47]:
# 양쪽에 공통적으로 존재하는 여러 개의 색인을 병합하는 것도 가능하다.

left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                    index=['a', 'b', 'e'],
                    columns=['Ohio', 'Nevada'])

In [48]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                     index=['b', 'c', 'd', 'e'],
                     columns=['Missouri', 'Alabama'])

In [49]:
left2

   Ohio  Nevada
a   1.0     2.0
b   3.0     4.0
e   5.0     6.0

In [50]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [51]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   3.0     4.0       7.0      8.0
c   NaN     NaN       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [52]:
# 색인 병합시 DataFrame의 join 메서드를 이용하면 편하다.
# join 메서드는 컬럼이 겹치지않으며 완전히 같거나 유사한 구조를 가진 여러개의 DataFrame 객체를 병합할 때 사용한다.

left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   3.0     4.0       7.0      8.0
c   NaN     NaN       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [53]:
# join 메서드는 기본적으로 왼쪽 조인을 수행한다.
# 설정을 통해 다른 컬럼에 대한 조인도 가능하다.

left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [54]:
# 색인 대 색인으로 두 DataFrame을 병합하려면 병합하려는 리스트를 join 메서드로 넘기면 된다.

anoter = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
                     index=['a', 'c', 'e', 'f'],
                     columns=['New York', 'Oregon'])

In [55]:
anoter

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [56]:
left2.join([right1, anoter])

   Ohio  Nevada  group_val  New York  Oregon
a   1.0     2.0        3.5       7.0     8.0
b   3.0     4.0        7.0       NaN     NaN
e   5.0     6.0        NaN      11.0    12.0

In [57]:
left2.join([right2, anoter], how='outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
b   3.0     4.0       7.0      8.0       NaN     NaN
e   5.0     6.0      13.0     14.0      11.0    12.0
c   NaN     NaN       9.0     10.0       9.0    10.0
d   NaN     NaN      11.0     12.0       NaN     NaN
f   NaN     NaN       NaN      NaN      16.0    17.0

In [1]:
##### 8.2.3 축 따라 이어붙이기 #####

In [3]:
# numpy는 ndarray를 이어붙이는 concatenate 함수를 제공한다.

arr = np.arange(12).reshape((3, 4))

In [4]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [5]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [6]:
# Series나 DataFrame 같은 pandas 객체의 context 내부에는 축마다 이름이 있어 배열을 쉽게 이어붙일 수 있다.

s1 = pd.Series([0, 1], index=['a', 'b'])

In [7]:
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])

In [9]:
s3 = pd.Series([5, 6], index=['f', 'g'])

In [10]:
# 이 새 객체를 리스트로 묶어 concat함수에 전달하면 값과 색인을 연결해준다.

pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [11]:
# concat함수는 axis=0을 기본값으로 새로운 Series객체를 생성하는데, axis=1을 넘기면 Series가 아니라 DataFrame이 된다.

pd.concat([s1, s2, s3], axis=1)

c:\users\lg\appdata\local\programs\python\python37-32\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  This is separate from the ipykernel package so we can avoid doing imports until

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [13]:
# 겹치는 축이 없어 외부 조인으로 정렬된 합집합을 얻었지만 join='inner'을 넘겨 교집합을 구할 수도 있다.

s4 = pd.concat([s1, s3])

In [14]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [15]:
pd.concat([s1, s4], axis=1)

c:\users\lg\appdata\local\programs\python\python37-32\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [16]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

In [17]:
# join_axes 인자로 병합하려는 축을 직접 지정해줄 수도 있다.

pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b', 'e']])

c:\users\lg\appdata\local\programs\python\python37-32\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  This is separate from the ipykernel package so we can avoid doing imports until

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  1.0
e  NaN  NaN

In [20]:
# Series를 이어붙이기 전의 개별 Series를 구분할 수 없는 문제가 생기는데, 계층적 색인을 생성하여 식별 가능하도록 할 수 있다.
# 계층적 색인을 생성하려면 keys 인자를 사용하면 된다.

result = pd.concat([s1, s2, s3], keys=['one', 'two', 'three'])

In [21]:
result

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [22]:
# keys를 가로형태로 만들어줌

result.unstack()

         a    b    c    d    e    f    g
one    0.0  1.0  NaN  NaN  NaN  NaN  NaN
two    NaN  NaN  2.0  3.0  4.0  NaN  NaN
three  NaN  NaN  NaN  NaN  NaN  5.0  6.0

In [23]:
# Series를 axis=1로 병합하는 경우 keys는 DataFrame의 컬럼 제목이 된다.

pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

c:\users\lg\appdata\local\programs\python\python37-32\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  This is separate from the ipykernel package so we can avoid doing imports until

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [24]:
# DataFrame에도 Series와 같은 방식을 적용할 수 있다.

df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
                  columns=['one', 'two'])

In [25]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],
                  columns=['three', 'four'])

In [26]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [27]:
df2

   three  four
a      5     6
c      7     8

In [28]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

c:\users\lg\appdata\local\programs\python\python37-32\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [29]:
# 리스트 대신 객체의 사전을 넘기면 사전의 키가 keys 옵션으로 사용된다.

pd.concat({'level1': df1, 'level2': df2}, axis=1)

c:\users\lg\appdata\local\programs\python\python37-32\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  This is separate from the ipykernel package so we can avoid doing imports until

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [30]:
# 새로 생성된 계층의 이름은 names 인자로 정할 수 있따.

pd.concat([df1, df2], axis=1, keys=['level1', 'level2'],
         names=['upper', 'lower'])

c:\users\lg\appdata\local\programs\python\python37-32\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [31]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])

In [32]:
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

In [33]:
df1

          a         b         c         d
0 -0.955661 -0.631099 -0.490852 -0.146448
1  1.520830  2.789937 -0.327547 -0.404911
2  0.644736 -0.121361  0.329064 -1.366353

In [34]:
df2

          b         d         a
0  0.416578  0.534356  1.173303
1  1.012099 -0.424618 -0.791616

In [35]:
pd.concat([df1, df2], ignore_index=True)

c:\users\lg\appdata\local\programs\python\python37-32\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          a         b         c         d
0 -0.955661 -0.631099 -0.490852 -0.146448
1  1.520830  2.789937 -0.327547 -0.404911
2  0.644736 -0.121361  0.329064 -1.366353
3  1.173303  0.416578       NaN  0.534356
4 -0.791616  1.012099       NaN -0.424618

In [36]:
##### 8.2.4 겹치는 데이터 합치기 #####

In [44]:
# 데이터를 합칠 때 두 데이터셋의 색인이 일부 겹치거나 전체가 겹치는 경우 병합이나 이어붙이기가 불가능하다.

In [38]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
             index=['f', 'e', 'd', 'c', 'b', 'a'])

In [39]:
b = pd.Series(np.arange(len(a), dtype=np.float64),
             index=['f', 'e', 'd', 'c', 'b', 'a'])

In [41]:
b[-1] = np.nan

In [42]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [43]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [45]:
np.where(pd.isnull(a), b, a)

array([0. , 2.5, 2. , 3.5, 4.5, nan])

In [46]:
# Series 객체의 conbine_first 메서드는 위와 동일한 연산을 제공하며 데이터 정렬 기능까지 제공한다.

b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [47]:
# DataFrame에서 combine_first 메서드는 컬럼에 대해 같은 동작을 한다.
# 그러므로 호출하는 객체에서 누락된 데이터를 인자로 넘긴 객체에 있는 값으로 채워 넣을 수 있다.

df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],
                   'b': [np.nan, 1., np.nan, 6.],
                   'c': range(2, 18, 4)})

In [48]:
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],
                   'b': [np.nan, 3., 4., 6., 8.]})

In [49]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  1.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [50]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [51]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  1.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN